Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/riscv_dm.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : RISCV_DM
// Version        : 1
// Bus type       : apb
// Description    : RISC-V Debug module registers (Hazard3 subset only). Read-
//                  only information fields (such as dmstatus.version) are
//                  listed here with the values they have on the RP2350
//                  instantiation of Hazard3.
// =============================================================================
#ifndef _HARDWARE_REGS_RISCV_DM_H
#define _HARDWARE_REGS_RISCV_DM_H
// =============================================================================
// Register    : RISCV_DM_DATA0
// Description : data0 through data11 are basic read/write registers that may be
//               read or changed by abstract commands. abstractcs.datacount
//               indicates how many of them are implemented, starting at data0,
//               counting up.
//
//               Accessing these registers while an abstract command is
//               executing causes abstractcs.cmderr to be set to 1 (busy) if it
//               is 0.
//
//               Attempts to write them while abstractcs.busy is set does not
//               change their value.
//
//               The values in these registers may not be preserved after an
//               abstract command is executed. The only guarantees on their
//               contents are the ones offered by the command in question. If
//               the command fails, no assumptions can be made about the
//               contents of these registers.
//
//               (Note: Hazard3 implements data0 only.)
#define RISCV_DM_DATA0_OFFSET _u(0x00000010)
#define RISCV_DM_DATA0_BITS   _u(0xffffffff)
#define RISCV_DM_DATA0_RESET  _u(0x00000000)
#define RISCV_DM_DATA0_MSB    _u(31)
#define RISCV_DM_DATA0_LSB    _u(0)
#define RISCV_DM_DATA0_ACCESS "RW"
// =============================================================================
// Register    : RISCV_DM_DMCONTROL
// Description : This register controls the overall Debug Module as well as the
//               currently selected harts, as defined in hasel.
#define RISCV_DM_DMCONTROL_OFFSET _u(0x00000040)
#define RISCV_DM_DMCONTROL_BITS   _u(0xf7ffffcf)
#define RISCV_DM_DMCONTROL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_HALTREQ
// Description : Writing 0 clears the halt request bit for all currently
//               selected harts. This may cancel outstanding halt requests for
//               those harts.
//
//               Writing 1 sets the halt request bit for all currently selected
//               harts. Running harts will halt whenever their halt request bit
//               is set.
//
//               Writes apply to the new value of hartsel and hasel.
#define RISCV_DM_DMCONTROL_HALTREQ_RESET  _u(0x0)
#define RISCV_DM_DMCONTROL_HALTREQ_BITS   _u(0x80000000)
#define RISCV_DM_DMCONTROL_HALTREQ_MSB    _u(31)
#define RISCV_DM_DMCONTROL_HALTREQ_LSB    _u(31)
#define RISCV_DM_DMCONTROL_HALTREQ_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_RESUMEREQ
// Description : Writing 1 causes the currently selected harts to resume once,
//               if they are halted when the write occurs. It also clears the
//               resume ack bit for those harts.
//
//               resumereq is ignored if haltreq is set.
//
//               Writes apply to the new value of hartsel and hasel.
#define RISCV_DM_DMCONTROL_RESUMEREQ_RESET  _u(0x0)
#define RISCV_DM_DMCONTROL_RESUMEREQ_BITS   _u(0x40000000)
#define RISCV_DM_DMCONTROL_RESUMEREQ_MSB    _u(30)
#define RISCV_DM_DMCONTROL_RESUMEREQ_LSB    _u(30)
#define RISCV_DM_DMCONTROL_RESUMEREQ_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_HARTRESET
// Description : This optional field writes the reset bit for all the currently
//               selected harts. To perform a reset the debugger writes 1, and
//               then writes 0 to deassert the reset signal.
//
//               While this bit is 1, the debugger must not change which harts
//               are selected.
//
//               Writes apply to the new value of hartsel and hasel.
//
//               (The exact behaviour of this field is implementation-defined:
//               on RP2350 it (triggers a local reset of the selected core(s)
//               only.)
#define RISCV_DM_DMCONTROL_HARTRESET_RESET  _u(0x0)
#define RISCV_DM_DMCONTROL_HARTRESET_BITS   _u(0x20000000)
#define RISCV_DM_DMCONTROL_HARTRESET_MSB    _u(29)
#define RISCV_DM_DMCONTROL_HARTRESET_LSB    _u(29)
#define RISCV_DM_DMCONTROL_HARTRESET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_ACKHAVERESET
// Description : 0: No effect.
//
//               1: Clears havereset for any selected harts.
//
//               Writes apply to the new value of hartsel and hasel.
#define RISCV_DM_DMCONTROL_ACKHAVERESET_RESET  _u(0x0)
#define RISCV_DM_DMCONTROL_ACKHAVERESET_BITS   _u(0x10000000)
#define RISCV_DM_DMCONTROL_ACKHAVERESET_MSB    _u(28)
#define RISCV_DM_DMCONTROL_ACKHAVERESET_LSB    _u(28)
#define RISCV_DM_DMCONTROL_ACKHAVERESET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_HASEL
// Description : Selects the definition of currently selected harts.
//
//               0: There is a single currently selected hart, that is selected
//               by hartsel.
//
//               1: There may be multiple currently selected harts – the hart
//               selected by hartsel, plus those selected by the hart array mask
//               register.
//
//               Hazard3 does support the hart array mask.
#define RISCV_DM_DMCONTROL_HASEL_RESET  _u(0x0)
#define RISCV_DM_DMCONTROL_HASEL_BITS   _u(0x04000000)
#define RISCV_DM_DMCONTROL_HASEL_MSB    _u(26)
#define RISCV_DM_DMCONTROL_HASEL_LSB    _u(26)
#define RISCV_DM_DMCONTROL_HASEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_HARTSELLO
// Description : The low 10 bits of hartsel: the DM-specific index of the hart
//               to select. This hart is always part of the currently selected
//               harts.
//
//               On RP2350, since there are only two cores (with one hart each),
//               only the least-significant bit is writable. The others are tied
//               to 0.
#define RISCV_DM_DMCONTROL_HARTSELLO_RESET  _u(0x000)
#define RISCV_DM_DMCONTROL_HARTSELLO_BITS   _u(0x03ff0000)
#define RISCV_DM_DMCONTROL_HARTSELLO_MSB    _u(25)
#define RISCV_DM_DMCONTROL_HARTSELLO_LSB    _u(16)
#define RISCV_DM_DMCONTROL_HARTSELLO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_HARTSELHI
// Description : The high 10 bits of hartsel: the DM-specific index of the hart
//               to select. This hart is always part of the currently selected
//               harts.
//
//               On Hazard3 this field is always tied to all-zeroes.
#define RISCV_DM_DMCONTROL_HARTSELHI_RESET  _u(0x000)
#define RISCV_DM_DMCONTROL_HARTSELHI_BITS   _u(0x0000ffc0)
#define RISCV_DM_DMCONTROL_HARTSELHI_MSB    _u(15)
#define RISCV_DM_DMCONTROL_HARTSELHI_LSB    _u(6)
#define RISCV_DM_DMCONTROL_HARTSELHI_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_SETRESETHALTREQ
// Description : This optional field writes the halt-on-reset request bit for
//               all currently selected harts, unless clrresethaltreq is
//               simultaneously set to 1.
//
//               When set to 1, each selected hart will halt upon the next
//               deassertion of its reset. The halt-on-reset request bit is not
//               automatically cleared. The debugger must write to
//               clrresethaltreq to clear it.
//
//               Writes apply to the new value of hartsel and hasel.
#define RISCV_DM_DMCONTROL_SETRESETHALTREQ_RESET  _u(0x0)
#define RISCV_DM_DMCONTROL_SETRESETHALTREQ_BITS   _u(0x00000008)
#define RISCV_DM_DMCONTROL_SETRESETHALTREQ_MSB    _u(3)
#define RISCV_DM_DMCONTROL_SETRESETHALTREQ_LSB    _u(3)
#define RISCV_DM_DMCONTROL_SETRESETHALTREQ_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_CLRRESETHALTREQ
// Description : This optional field clears the halt-on-reset request bit for
//               all currently selected harts.
//
//               Writes apply to the new value of hartsel and hasel.
#define RISCV_DM_DMCONTROL_CLRRESETHALTREQ_RESET  _u(0x0)
#define RISCV_DM_DMCONTROL_CLRRESETHALTREQ_BITS   _u(0x00000004)
#define RISCV_DM_DMCONTROL_CLRRESETHALTREQ_MSB    _u(2)
#define RISCV_DM_DMCONTROL_CLRRESETHALTREQ_LSB    _u(2)
#define RISCV_DM_DMCONTROL_CLRRESETHALTREQ_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_NDMRESET
// Description : This bit controls the reset signal from the DM to the rest of
//               the system. The signal should reset every part of the system,
//               including every hart, except for the DM and any logic required
//               to access the DM. To perform a system reset the debugger writes
//               1, and then writes 0 to deassert the reset.
//
//               On RP2350 this performs a cold reset, the equivalent of a
//               watchdog reset with all WDSEL bits set. This includes both
//               cores and all peripherals.
#define RISCV_DM_DMCONTROL_NDMRESET_RESET  _u(0x0)
#define RISCV_DM_DMCONTROL_NDMRESET_BITS   _u(0x00000002)
#define RISCV_DM_DMCONTROL_NDMRESET_MSB    _u(1)
#define RISCV_DM_DMCONTROL_NDMRESET_LSB    _u(1)
#define RISCV_DM_DMCONTROL_NDMRESET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMCONTROL_DMACTIVE
// Description : This bit serves as a reset signal for the Debug Module itself.
//
//               0: The module’s state, including authentication mechanism,
//               takes its reset values (the dmactive bit is the only bit which
//               can be written to something other than its reset value).
//
//               1: The module functions normally.
//
//               No other mechanism should exist that may result in resetting
//               the Debug Module after power up, with the possible (but not
//               recommended) exception of a global reset signal that resets the
//               entire platform.
//
//               (On RP2350, the Debug Module is reset by a power-on reset, a
//               brownout reset, the RUN pin, and a rescue reset.)
//
//               A debugger may pulse this bit low to get the Debug Module into
//               a known state.
#define RISCV_DM_DMCONTROL_DMACTIVE_RESET  _u(0x0)
#define RISCV_DM_DMCONTROL_DMACTIVE_BITS   _u(0x00000001)
#define RISCV_DM_DMCONTROL_DMACTIVE_MSB    _u(0)
#define RISCV_DM_DMCONTROL_DMACTIVE_LSB    _u(0)
#define RISCV_DM_DMCONTROL_DMACTIVE_ACCESS "RW"
// =============================================================================
// Register    : RISCV_DM_DMSTATUS
// Description : This register reports status for the overall Debug Module as
//               well as the currently selected harts, as defined in hasel. Its
//               address will not change in the future, because it contains
//               version.
//
//               This entire register is read-only.
#define RISCV_DM_DMSTATUS_OFFSET _u(0x00000044)
#define RISCV_DM_DMSTATUS_BITS   _u(0x004fffff)
#define RISCV_DM_DMSTATUS_RESET  _u(0x004000a2)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_IMPEBREAK
// Description : If 1, then there is an implicit ebreak instruction at the non-
//               existent word immediately after the Program Buffer. This saves
//               the debugger from having to write the ebreak itself, and allows
//               the Program Buffer to be one word smaller.
#define RISCV_DM_DMSTATUS_IMPEBREAK_RESET  _u(0x1)
#define RISCV_DM_DMSTATUS_IMPEBREAK_BITS   _u(0x00400000)
#define RISCV_DM_DMSTATUS_IMPEBREAK_MSB    _u(22)
#define RISCV_DM_DMSTATUS_IMPEBREAK_LSB    _u(22)
#define RISCV_DM_DMSTATUS_IMPEBREAK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ALLHAVERESET
// Description : This field is 1 when all currently selected harts have been
//               reset and reset has not been acknowledged for any of them.
#define RISCV_DM_DMSTATUS_ALLHAVERESET_RESET  _u(0x0)
#define RISCV_DM_DMSTATUS_ALLHAVERESET_BITS   _u(0x00080000)
#define RISCV_DM_DMSTATUS_ALLHAVERESET_MSB    _u(19)
#define RISCV_DM_DMSTATUS_ALLHAVERESET_LSB    _u(19)
#define RISCV_DM_DMSTATUS_ALLHAVERESET_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ANYHAVERESET
// Description : This field is 1 when at least one currently selected hart has
//               been reset and reset has not been acknowledged for that hart.
#define RISCV_DM_DMSTATUS_ANYHAVERESET_RESET  _u(0x0)
#define RISCV_DM_DMSTATUS_ANYHAVERESET_BITS   _u(0x00040000)
#define RISCV_DM_DMSTATUS_ANYHAVERESET_MSB    _u(18)
#define RISCV_DM_DMSTATUS_ANYHAVERESET_LSB    _u(18)
#define RISCV_DM_DMSTATUS_ANYHAVERESET_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ALLRESUMEACK
// Description : This field is 1 when all currently selected harts have
//               acknowledged their last resume request.
#define RISCV_DM_DMSTATUS_ALLRESUMEACK_RESET  _u(0x0)
#define RISCV_DM_DMSTATUS_ALLRESUMEACK_BITS   _u(0x00020000)
#define RISCV_DM_DMSTATUS_ALLRESUMEACK_MSB    _u(17)
#define RISCV_DM_DMSTATUS_ALLRESUMEACK_LSB    _u(17)
#define RISCV_DM_DMSTATUS_ALLRESUMEACK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ANYRESUMEACK
// Description : This field is 1 when any currently selected hart has
//               acknowledged its last resume request.
#define RISCV_DM_DMSTATUS_ANYRESUMEACK_RESET  _u(0x0)
#define RISCV_DM_DMSTATUS_ANYRESUMEACK_BITS   _u(0x00010000)
#define RISCV_DM_DMSTATUS_ANYRESUMEACK_MSB    _u(16)
#define RISCV_DM_DMSTATUS_ANYRESUMEACK_LSB    _u(16)
#define RISCV_DM_DMSTATUS_ANYRESUMEACK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ALLNONEXISTENT
// Description : This field is 1 when all currently selected harts do not exist
//               on this platform.
#define RISCV_DM_DMSTATUS_ALLNONEXISTENT_RESET  "-"
#define RISCV_DM_DMSTATUS_ALLNONEXISTENT_BITS   _u(0x00008000)
#define RISCV_DM_DMSTATUS_ALLNONEXISTENT_MSB    _u(15)
#define RISCV_DM_DMSTATUS_ALLNONEXISTENT_LSB    _u(15)
#define RISCV_DM_DMSTATUS_ALLNONEXISTENT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ANYNONEXISTENT
// Description : This field is 1 when any currently selected hart does not exist
//               in this platform.
#define RISCV_DM_DMSTATUS_ANYNONEXISTENT_RESET  "-"
#define RISCV_DM_DMSTATUS_ANYNONEXISTENT_BITS   _u(0x00004000)
#define RISCV_DM_DMSTATUS_ANYNONEXISTENT_MSB    _u(14)
#define RISCV_DM_DMSTATUS_ANYNONEXISTENT_LSB    _u(14)
#define RISCV_DM_DMSTATUS_ANYNONEXISTENT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ALLUNAVAIL
// Description : This field is 1 when all currently selected harts are
//               unavailable.
#define RISCV_DM_DMSTATUS_ALLUNAVAIL_RESET  "-"
#define RISCV_DM_DMSTATUS_ALLUNAVAIL_BITS   _u(0x00002000)
#define RISCV_DM_DMSTATUS_ALLUNAVAIL_MSB    _u(13)
#define RISCV_DM_DMSTATUS_ALLUNAVAIL_LSB    _u(13)
#define RISCV_DM_DMSTATUS_ALLUNAVAIL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ANYUNAVAIL
// Description : This field is 1 when any currently selected hart is
//               unavailable.
#define RISCV_DM_DMSTATUS_ANYUNAVAIL_RESET  "-"
#define RISCV_DM_DMSTATUS_ANYUNAVAIL_BITS   _u(0x00001000)
#define RISCV_DM_DMSTATUS_ANYUNAVAIL_MSB    _u(12)
#define RISCV_DM_DMSTATUS_ANYUNAVAIL_LSB    _u(12)
#define RISCV_DM_DMSTATUS_ANYUNAVAIL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ALLRUNNING
// Description : This field is 1 when all currently selected harts are running.
#define RISCV_DM_DMSTATUS_ALLRUNNING_RESET  _u(0x0)
#define RISCV_DM_DMSTATUS_ALLRUNNING_BITS   _u(0x00000800)
#define RISCV_DM_DMSTATUS_ALLRUNNING_MSB    _u(11)
#define RISCV_DM_DMSTATUS_ALLRUNNING_LSB    _u(11)
#define RISCV_DM_DMSTATUS_ALLRUNNING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ANYRUNNING
// Description : This field is 1 when any currently selected hart is running.
#define RISCV_DM_DMSTATUS_ANYRUNNING_RESET  _u(0x0)
#define RISCV_DM_DMSTATUS_ANYRUNNING_BITS   _u(0x00000400)
#define RISCV_DM_DMSTATUS_ANYRUNNING_MSB    _u(10)
#define RISCV_DM_DMSTATUS_ANYRUNNING_LSB    _u(10)
#define RISCV_DM_DMSTATUS_ANYRUNNING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ALLHALTED
// Description : This field is 1 when all currently selected harts are halted.
#define RISCV_DM_DMSTATUS_ALLHALTED_RESET  _u(0x0)
#define RISCV_DM_DMSTATUS_ALLHALTED_BITS   _u(0x00000200)
#define RISCV_DM_DMSTATUS_ALLHALTED_MSB    _u(9)
#define RISCV_DM_DMSTATUS_ALLHALTED_LSB    _u(9)
#define RISCV_DM_DMSTATUS_ALLHALTED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_ANYHALTED
// Description : This field is 1 when any currently selected hart is halted.
#define RISCV_DM_DMSTATUS_ANYHALTED_RESET  _u(0x0)
#define RISCV_DM_DMSTATUS_ANYHALTED_BITS   _u(0x00000100)
#define RISCV_DM_DMSTATUS_ANYHALTED_MSB    _u(8)
#define RISCV_DM_DMSTATUS_ANYHALTED_LSB    _u(8)
#define RISCV_DM_DMSTATUS_ANYHALTED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_AUTHENTICATED
// Description : 0: Authentication is required before using the DM.
//
//               1: The authentication check has passed.
//
//               On components that don’t implement authentication, this bit
//               must be preset as 1. (Note: the version of Hazard3 on RP2350
//               does not implement authentication.)
#define RISCV_DM_DMSTATUS_AUTHENTICATED_RESET  _u(0x1)
#define RISCV_DM_DMSTATUS_AUTHENTICATED_BITS   _u(0x00000080)
#define RISCV_DM_DMSTATUS_AUTHENTICATED_MSB    _u(7)
#define RISCV_DM_DMSTATUS_AUTHENTICATED_LSB    _u(7)
#define RISCV_DM_DMSTATUS_AUTHENTICATED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_AUTHBUSY
// Description : 0: The authentication module is ready to process the next
//               read/write to authdata.
//
//               1: The authentication module is busy. Accessing authdata
//               results in unspecified behavior. authbusy only becomes set in
//               immediate response to an access to authdata.
#define RISCV_DM_DMSTATUS_AUTHBUSY_RESET  _u(0x0)
#define RISCV_DM_DMSTATUS_AUTHBUSY_BITS   _u(0x00000040)
#define RISCV_DM_DMSTATUS_AUTHBUSY_MSB    _u(6)
#define RISCV_DM_DMSTATUS_AUTHBUSY_LSB    _u(6)
#define RISCV_DM_DMSTATUS_AUTHBUSY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_HASRESETHALTREQ
// Description : 1 if this Debug Module supports halt-on-reset functionality
//               controllable by the setresethaltreq and clrresethaltreq bits. 0
//               otherwise.
#define RISCV_DM_DMSTATUS_HASRESETHALTREQ_RESET  _u(0x1)
#define RISCV_DM_DMSTATUS_HASRESETHALTREQ_BITS   _u(0x00000020)
#define RISCV_DM_DMSTATUS_HASRESETHALTREQ_MSB    _u(5)
#define RISCV_DM_DMSTATUS_HASRESETHALTREQ_LSB    _u(5)
#define RISCV_DM_DMSTATUS_HASRESETHALTREQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_CONFSTPTRVALID
// Description : 0: confstrptr0–confstrptr3 hold information which is not
//               relevant to the configuration string.
//
//               1: confstrptr0–confstrptr3 hold the address of the
//               configuration string.
#define RISCV_DM_DMSTATUS_CONFSTPTRVALID_RESET  _u(0x0)
#define RISCV_DM_DMSTATUS_CONFSTPTRVALID_BITS   _u(0x00000010)
#define RISCV_DM_DMSTATUS_CONFSTPTRVALID_MSB    _u(4)
#define RISCV_DM_DMSTATUS_CONFSTPTRVALID_LSB    _u(4)
#define RISCV_DM_DMSTATUS_CONFSTPTRVALID_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_DMSTATUS_VERSION
// Description : 0: There is no Debug Module present. 1: There is a Debug Module
//               and it conforms to version 0.11 of the RISC-V debug
//               specification.
//
//               2: There is a Debug Module and it conforms to version 0.13 of
//               the RISC-V debug specification.
//
//               15: There is a Debug Module but it does not con- form to any
//               available version of the RISC-V debug spec.
#define RISCV_DM_DMSTATUS_VERSION_RESET  _u(0x2)
#define RISCV_DM_DMSTATUS_VERSION_BITS   _u(0x0000000f)
#define RISCV_DM_DMSTATUS_VERSION_MSB    _u(3)
#define RISCV_DM_DMSTATUS_VERSION_LSB    _u(0)
#define RISCV_DM_DMSTATUS_VERSION_ACCESS "RO"
// =============================================================================
// Register    : RISCV_DM_HARTINFO
// Description : This register gives information about the hart currently
//               selected by hartsel.
//
//               This entire register is read-only.
#define RISCV_DM_HARTINFO_OFFSET _u(0x00000048)
#define RISCV_DM_HARTINFO_BITS   _u(0x00f1ffff)
#define RISCV_DM_HARTINFO_RESET  _u(0x00001bff)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_HARTINFO_NSCRATCH
// Description : Number of dscratch registers available for the debugger to use
//               during program buffer execution, starting from dscratch0. The
//               debugger can make no assumptions about the contents of these
//               registers between commands.
#define RISCV_DM_HARTINFO_NSCRATCH_RESET  _u(0x0)
#define RISCV_DM_HARTINFO_NSCRATCH_BITS   _u(0x00f00000)
#define RISCV_DM_HARTINFO_NSCRATCH_MSB    _u(23)
#define RISCV_DM_HARTINFO_NSCRATCH_LSB    _u(20)
#define RISCV_DM_HARTINFO_NSCRATCH_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_HARTINFO_DATAACCESS
// Description : 0: The data registers are shadowed in the hart by CSRs. Each
//               CSR is DXLEN bits in size, and corresponds to a single
//               argument.
//
//               1: The data registers are shadowed in the hart’s memory map.
//               Each register takes up 4 bytes in the memory map.
