Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/riscv_dm.h
#define RISCV_DM_HARTINFO_DATAACCESS_RESET  _u(0x0)
#define RISCV_DM_HARTINFO_DATAACCESS_BITS   _u(0x00010000)
#define RISCV_DM_HARTINFO_DATAACCESS_MSB    _u(16)
#define RISCV_DM_HARTINFO_DATAACCESS_LSB    _u(16)
#define RISCV_DM_HARTINFO_DATAACCESS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_HARTINFO_DATASIZE
// Description : If dataaccess is 0: Number of CSRs dedicated to shadowing the
//               data registers.
//
//               If dataaccess is 1: Number of 32-bit words in the memory map
//               dedicated to shadowing the data registers.
#define RISCV_DM_HARTINFO_DATASIZE_RESET  _u(0x1)
#define RISCV_DM_HARTINFO_DATASIZE_BITS   _u(0x0000f000)
#define RISCV_DM_HARTINFO_DATASIZE_MSB    _u(15)
#define RISCV_DM_HARTINFO_DATASIZE_LSB    _u(12)
#define RISCV_DM_HARTINFO_DATASIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_HARTINFO_DATAADDR
// Description : If dataaccess is 0: The number of the first CSR dedicated to
//               shadowing the data registers.
//
//               If dataaccess is 1: Signed address of RAM where the data
//               registers are shadowed, to be used to access relative to zero
//
//               On Hazard3 this indicates the single data register mapped as
//               dmdata0. There is actually only a single shared register,
//               internal to the Debug Module, and mirrored in each core's CSR
//               space.
#define RISCV_DM_HARTINFO_DATAADDR_RESET  _u(0xbff)
#define RISCV_DM_HARTINFO_DATAADDR_BITS   _u(0x00000fff)
#define RISCV_DM_HARTINFO_DATAADDR_MSB    _u(11)
#define RISCV_DM_HARTINFO_DATAADDR_LSB    _u(0)
#define RISCV_DM_HARTINFO_DATAADDR_ACCESS "RW"
// =============================================================================
// Register    : RISCV_DM_HALTSUM1
// Description : Each bit in this read-only register indicates whether any of a
//               group of harts is halted or not. Unavailable/nonexistent harts
//               are not considered to be halted.
//
//               Each bit in haltsum1 is an OR reduction of 32 bits' worth of
//               haltsum0. On RP2350, only the LSB is implemented.
#define RISCV_DM_HALTSUM1_OFFSET _u(0x0000004c)
#define RISCV_DM_HALTSUM1_BITS   _u(0x00000001)
#define RISCV_DM_HALTSUM1_RESET  _u(0x00000000)
#define RISCV_DM_HALTSUM1_MSB    _u(0)
#define RISCV_DM_HALTSUM1_LSB    _u(0)
#define RISCV_DM_HALTSUM1_ACCESS "RO"
// =============================================================================
// Register    : RISCV_DM_HAWINDOWSEL
// Description : This register selects which of the 32-bit portion of the hart
//               array mask register is accessible in hawindow.
#define RISCV_DM_HAWINDOWSEL_OFFSET _u(0x00000050)
#define RISCV_DM_HAWINDOWSEL_BITS   _u(0x00007fff)
#define RISCV_DM_HAWINDOWSEL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_HAWINDOWSEL_HAWINDOWSEL
// Description : On Hazard3 this register is entirely hardwired to 0.
#define RISCV_DM_HAWINDOWSEL_HAWINDOWSEL_RESET  _u(0x0000)
#define RISCV_DM_HAWINDOWSEL_HAWINDOWSEL_BITS   _u(0x00007fff)
#define RISCV_DM_HAWINDOWSEL_HAWINDOWSEL_MSB    _u(14)
#define RISCV_DM_HAWINDOWSEL_HAWINDOWSEL_LSB    _u(0)
#define RISCV_DM_HAWINDOWSEL_HAWINDOWSEL_ACCESS "RW"
// =============================================================================
// Register    : RISCV_DM_HAWINDOW
// Description : This register provides R/W access to a 32-bit portion of the
//               hart array mask register. The position of the window is
//               determined by hawindowsel. I.e. bit 0 refers to hart
//               hawindowsel ∗ 32, while bit 31 refers to hart hawindowsel ∗ 32
//               + 31.
//
//               On RP2350 only the two least-significant bits of this register
//               are implemented, since there are only two cores. This is still
//               useful to run/halt/reset both cores exactly simultaneously.
#define RISCV_DM_HAWINDOW_OFFSET _u(0x00000054)
#define RISCV_DM_HAWINDOW_BITS   _u(0x00000003)
#define RISCV_DM_HAWINDOW_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_HAWINDOW_MASKDATA
#define RISCV_DM_HAWINDOW_MASKDATA_RESET  _u(0x0)
#define RISCV_DM_HAWINDOW_MASKDATA_BITS   _u(0x00000003)
#define RISCV_DM_HAWINDOW_MASKDATA_MSB    _u(1)
#define RISCV_DM_HAWINDOW_MASKDATA_LSB    _u(0)
#define RISCV_DM_HAWINDOW_MASKDATA_ACCESS "RW"
// =============================================================================
// Register    : RISCV_DM_ABSTRACTS
// Description : Abstract Control and Status. Writing this register while an
//               abstract command is executing causes cmderr to be set to 1
//               (busy) if it is 0.
#define RISCV_DM_ABSTRACTS_OFFSET _u(0x00000058)
#define RISCV_DM_ABSTRACTS_BITS   _u(0x1f00170f)
#define RISCV_DM_ABSTRACTS_RESET  _u(0x02000001)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_ABSTRACTS_PROGBUFSIZE
// Description : Size of the Program Buffer, in 32-bit words.
#define RISCV_DM_ABSTRACTS_PROGBUFSIZE_RESET  _u(0x02)
#define RISCV_DM_ABSTRACTS_PROGBUFSIZE_BITS   _u(0x1f000000)
#define RISCV_DM_ABSTRACTS_PROGBUFSIZE_MSB    _u(28)
#define RISCV_DM_ABSTRACTS_PROGBUFSIZE_LSB    _u(24)
#define RISCV_DM_ABSTRACTS_PROGBUFSIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_ABSTRACTS_BUSY
// Description : 1: An abstract command is currently being executed.
//
//               This bit is set as soon as command is written, and is not
//               cleared until that command has completed.
#define RISCV_DM_ABSTRACTS_BUSY_RESET  _u(0x0)
#define RISCV_DM_ABSTRACTS_BUSY_BITS   _u(0x00001000)
#define RISCV_DM_ABSTRACTS_BUSY_MSB    _u(12)
#define RISCV_DM_ABSTRACTS_BUSY_LSB    _u(12)
#define RISCV_DM_ABSTRACTS_BUSY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_ABSTRACTS_CMDERR
// Description : Gets set if an abstract command fails. The bits in this field
//               remain set until they are cleared by writing 1 to them. No
//               abstract command is started until the value is reset to 0.
//
//               This field only contains a valid value if busy is 0.
//
//               0 (none): No error.
//
//               1 (busy): An abstract command was executing while command,
//               abstractcs, or abstractauto was written, or when one of the
//               data or progbuf registers was read or written. This status is
//               only written if cmderr contains 0.
//
//               2 (not supported): The requested command is not supported,
//               regardless of whether the hart is running or not.
//
//               3 (exception): An exception occurred while executing the
//               command (e.g. while executing the Program Buffer).
//
//               4 (halt/resume): The abstract command couldn’t execute because
//               the hart wasn’t in the required state (running/halted), or
//               unavailable.
//
//               5 (bus): The abstract command failed due to a bus error (e.g.
//               alignment, access size, or timeout).
//
//               7 (other): The command failed for another reason.
//
//               Note: Hazard3 does not set values 5 or 7. Load/store
//               instructions in the program buffer raise an exception when they
//               encounter a bus fault, setting cmderr=3.
#define RISCV_DM_ABSTRACTS_CMDERR_RESET  _u(0x0)
#define RISCV_DM_ABSTRACTS_CMDERR_BITS   _u(0x00000700)
#define RISCV_DM_ABSTRACTS_CMDERR_MSB    _u(10)
#define RISCV_DM_ABSTRACTS_CMDERR_LSB    _u(8)
#define RISCV_DM_ABSTRACTS_CMDERR_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_ABSTRACTS_DATACOUNT
// Description : Number of data registers that are implemented as part of the
//               abstract command interface.
#define RISCV_DM_ABSTRACTS_DATACOUNT_RESET  _u(0x1)
#define RISCV_DM_ABSTRACTS_DATACOUNT_BITS   _u(0x0000000f)
#define RISCV_DM_ABSTRACTS_DATACOUNT_MSB    _u(3)
#define RISCV_DM_ABSTRACTS_DATACOUNT_LSB    _u(0)
#define RISCV_DM_ABSTRACTS_DATACOUNT_ACCESS "RO"
// =============================================================================
// Register    : RISCV_DM_COMMAND
// Description : Writes to this register cause the corresponding abstract
//               command to be executed.
//
//               Writing this register while an abstract command is executing
//               causes cmderr to be set to 1 (busy) if it is 0.
//
//               If cmderr is non-zero, writes to this register are ignored.
#define RISCV_DM_COMMAND_OFFSET _u(0x0000005c)
#define RISCV_DM_COMMAND_BITS   _u(0xff7fffff)
#define RISCV_DM_COMMAND_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_COMMAND_CMDTYPE
// Description : On Hazard3 this field must be 0 (Access Register)
#define RISCV_DM_COMMAND_CMDTYPE_RESET  _u(0x00)
#define RISCV_DM_COMMAND_CMDTYPE_BITS   _u(0xff000000)
#define RISCV_DM_COMMAND_CMDTYPE_MSB    _u(31)
#define RISCV_DM_COMMAND_CMDTYPE_LSB    _u(24)
#define RISCV_DM_COMMAND_CMDTYPE_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_COMMAND_AARSIZE
// Description : On Hazard3 this field must be 2 (32-bit register access)
#define RISCV_DM_COMMAND_AARSIZE_RESET  _u(0x0)
#define RISCV_DM_COMMAND_AARSIZE_BITS   _u(0x00700000)
#define RISCV_DM_COMMAND_AARSIZE_MSB    _u(22)
#define RISCV_DM_COMMAND_AARSIZE_LSB    _u(20)
#define RISCV_DM_COMMAND_AARSIZE_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_COMMAND_AARPOSTINCREMENT
// Description : On Hazard3 this field must be 0 (no post-increment of regno)
#define RISCV_DM_COMMAND_AARPOSTINCREMENT_RESET  _u(0x0)
#define RISCV_DM_COMMAND_AARPOSTINCREMENT_BITS   _u(0x00080000)
#define RISCV_DM_COMMAND_AARPOSTINCREMENT_MSB    _u(19)
#define RISCV_DM_COMMAND_AARPOSTINCREMENT_LSB    _u(19)
#define RISCV_DM_COMMAND_AARPOSTINCREMENT_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_COMMAND_POSTEXEC
// Description : 0: No effect.
//
//               1: Execute the program in the Program Buffer exactly once after
//               performing the transfer, if any.
#define RISCV_DM_COMMAND_POSTEXEC_RESET  _u(0x0)
#define RISCV_DM_COMMAND_POSTEXEC_BITS   _u(0x00040000)
#define RISCV_DM_COMMAND_POSTEXEC_MSB    _u(18)
#define RISCV_DM_COMMAND_POSTEXEC_LSB    _u(18)
#define RISCV_DM_COMMAND_POSTEXEC_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_COMMAND_TRANSFER
// Description : 0: Don’t do the operation specified by write.
//
//               1: Do the operation specified by write.
//
//               This bit can be used to just execute the Program Buffer without
//               having to worry about placing valid values into aarsize or
//               regno.
#define RISCV_DM_COMMAND_TRANSFER_RESET  _u(0x0)
#define RISCV_DM_COMMAND_TRANSFER_BITS   _u(0x00020000)
#define RISCV_DM_COMMAND_TRANSFER_MSB    _u(17)
#define RISCV_DM_COMMAND_TRANSFER_LSB    _u(17)
#define RISCV_DM_COMMAND_TRANSFER_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_COMMAND_WRITE
// Description : When transfer is set:
//
//               0: Copy data from the specified register into data0.
//
//               1: Copy data from data0 into the specified register.
#define RISCV_DM_COMMAND_WRITE_RESET  _u(0x0)
#define RISCV_DM_COMMAND_WRITE_BITS   _u(0x00010000)
#define RISCV_DM_COMMAND_WRITE_MSB    _u(16)
#define RISCV_DM_COMMAND_WRITE_LSB    _u(16)
#define RISCV_DM_COMMAND_WRITE_ACCESS "WO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_COMMAND_REGNO
// Description : Number of the register to access.
//
//               On Hazard3 this must be in the range 0x1000 through 0x101f
//               inclusive, referring to GPRs x0 through x31.
#define RISCV_DM_COMMAND_REGNO_RESET  _u(0x0000)
#define RISCV_DM_COMMAND_REGNO_BITS   _u(0x0000ffff)
#define RISCV_DM_COMMAND_REGNO_MSB    _u(15)
#define RISCV_DM_COMMAND_REGNO_LSB    _u(0)
#define RISCV_DM_COMMAND_REGNO_ACCESS "WO"
// =============================================================================
// Register    : RISCV_DM_ABSTRACTAUTO
// Description : Abstract Command Autoexec. Writing this register while an
//               abstract command is executing causes cmderr to be set to 1
//               (busy) if it is 0.
#define RISCV_DM_ABSTRACTAUTO_OFFSET _u(0x00000060)
#define RISCV_DM_ABSTRACTAUTO_BITS   _u(0xffff8fff)
#define RISCV_DM_ABSTRACTAUTO_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_ABSTRACTAUTO_AUTOEXECPROGBUF
// Description : When a bit in this field is 1, read or write accesses to the
//               corresponding progbuf word cause the command in command to be
//               executed again.
//
//               Hazard3 implements only the two least-significant bits of this
//               field (for the two-entry progbuf)
#define RISCV_DM_ABSTRACTAUTO_AUTOEXECPROGBUF_RESET  _u(0x00000)
#define RISCV_DM_ABSTRACTAUTO_AUTOEXECPROGBUF_BITS   _u(0xffff8000)
#define RISCV_DM_ABSTRACTAUTO_AUTOEXECPROGBUF_MSB    _u(31)
#define RISCV_DM_ABSTRACTAUTO_AUTOEXECPROGBUF_LSB    _u(15)
#define RISCV_DM_ABSTRACTAUTO_AUTOEXECPROGBUF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_ABSTRACTAUTO_AUTOEXEDDATA
// Description : When a bit in this field is 1, read or write accesses to the
//               corresponding data word cause the command in command to be
//               executed again.
//
//               Hazard3 implements only the least-significant bit of this
//               field.
#define RISCV_DM_ABSTRACTAUTO_AUTOEXEDDATA_RESET  _u(0x000)
#define RISCV_DM_ABSTRACTAUTO_AUTOEXEDDATA_BITS   _u(0x00000fff)
#define RISCV_DM_ABSTRACTAUTO_AUTOEXEDDATA_MSB    _u(11)
#define RISCV_DM_ABSTRACTAUTO_AUTOEXEDDATA_LSB    _u(0)
#define RISCV_DM_ABSTRACTAUTO_AUTOEXEDDATA_ACCESS "RW"
// =============================================================================
// Register    : RISCV_DM_NEXTDM
// Description : If there is more than one DM accessible on this DMI, this
//               register contains the base address of thenext one in the chain,
//               or 0 if this is the last one in the chain.
#define RISCV_DM_NEXTDM_OFFSET _u(0x00000074)
#define RISCV_DM_NEXTDM_BITS   _u(0xffffffff)
#define RISCV_DM_NEXTDM_RESET  _u(0x00000000)
#define RISCV_DM_NEXTDM_MSB    _u(31)
#define RISCV_DM_NEXTDM_LSB    _u(0)
#define RISCV_DM_NEXTDM_ACCESS "RO"
// =============================================================================
// Register    : RISCV_DM_PROGBUF0
// Description : progbuf0 through progbuf15 provide read/write access to the
//               program buffer. abstractcs.progbufsize indicates how many of
//               them are implemented starting at progbuf0, counting up.
//
//               (Hazard3 implements a 2-word program buffer.)
#define RISCV_DM_PROGBUF0_OFFSET _u(0x00000080)
#define RISCV_DM_PROGBUF0_BITS   _u(0xffffffff)
#define RISCV_DM_PROGBUF0_RESET  _u(0x00000000)
#define RISCV_DM_PROGBUF0_MSB    _u(31)
#define RISCV_DM_PROGBUF0_LSB    _u(0)
#define RISCV_DM_PROGBUF0_ACCESS "RW"
// =============================================================================
// Register    : RISCV_DM_PROGBUF1
// Description : progbuf0 through progbuf15 provide read/write access to the
//               program buffer. abstractcs.progbufsize indicates how many of
//               them are implemented starting at progbuf0, counting up.
//
//               (Hazard3 implements a 2-word program buffer.)
#define RISCV_DM_PROGBUF1_OFFSET _u(0x00000084)
#define RISCV_DM_PROGBUF1_BITS   _u(0xffffffff)
#define RISCV_DM_PROGBUF1_RESET  _u(0x00000000)
#define RISCV_DM_PROGBUF1_MSB    _u(31)
#define RISCV_DM_PROGBUF1_LSB    _u(0)
#define RISCV_DM_PROGBUF1_ACCESS "RW"
// =============================================================================
// Register    : RISCV_DM_SBCS
// Description : System Bus Access Control and Status
#define RISCV_DM_SBCS_OFFSET _u(0x000000e0)
#define RISCV_DM_SBCS_BITS   _u(0xe07fffff)
#define RISCV_DM_SBCS_RESET  _u(0x20000407)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBVERSION
// Description : 1: The System Bus interface conforms to version 0.13.2 of the
//               RISC-V debug spec.
#define RISCV_DM_SBCS_SBVERSION_RESET  _u(0x1)
#define RISCV_DM_SBCS_SBVERSION_BITS   _u(0xe0000000)
#define RISCV_DM_SBCS_SBVERSION_MSB    _u(31)
#define RISCV_DM_SBCS_SBVERSION_LSB    _u(29)
#define RISCV_DM_SBCS_SBVERSION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBBUSYERROR
// Description : Set when the debugger attempts to read data while a read is in
//               progress, or when the debugger initiates a new access while one
//               is already in progress (while sbbusy is set). It remains set
//               until it’s explicitly cleared by the debugger.
//
//               While this field is set, no more system bus accesses can be
//               initiated by the Debug Module.
#define RISCV_DM_SBCS_SBBUSYERROR_RESET  _u(0x0)
#define RISCV_DM_SBCS_SBBUSYERROR_BITS   _u(0x00400000)
#define RISCV_DM_SBCS_SBBUSYERROR_MSB    _u(22)
#define RISCV_DM_SBCS_SBBUSYERROR_LSB    _u(22)
#define RISCV_DM_SBCS_SBBUSYERROR_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBBUSY
// Description : When 1, indicates the system bus master is busy. (Whether the
//               system bus itself is busy is related, but not the same thing.)
//               This bit goes high immediately when a read or write is
//               requested for any reason, and does not go low until the access
//               is fully completed.
//
//               Writes to sbcs while sbbusy is high result in undefined
//               behavior. A debugger must not write to sbcs until it reads
//               sbbusy as 0.
#define RISCV_DM_SBCS_SBBUSY_RESET  _u(0x0)
#define RISCV_DM_SBCS_SBBUSY_BITS   _u(0x00200000)
#define RISCV_DM_SBCS_SBBUSY_MSB    _u(21)
#define RISCV_DM_SBCS_SBBUSY_LSB    _u(21)
#define RISCV_DM_SBCS_SBBUSY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBREADONADDR
// Description : When 1, every write to sbaddress0 automatically triggers a
//               system bus read at the new address.
#define RISCV_DM_SBCS_SBREADONADDR_RESET  _u(0x0)
#define RISCV_DM_SBCS_SBREADONADDR_BITS   _u(0x00100000)
#define RISCV_DM_SBCS_SBREADONADDR_MSB    _u(20)
#define RISCV_DM_SBCS_SBREADONADDR_LSB    _u(20)
#define RISCV_DM_SBCS_SBREADONADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBACCESS
// Description : Select the access size to use for system bus accesses.
//
//               0: 8-bit
//
//               1: 16-bit
//
//               2: 32-bit
//
//               3: 64-bit
//
//               4: 128-bit
//
//               If sbaccess has an unsupported value when the DM starts a bus
//               access, the access is not per formed and sberror is set to 4.
//               (On Hazard3 the supported values are 8-bit, 16-bit and 32-bit.)
#define RISCV_DM_SBCS_SBACCESS_RESET  _u(0x0)
#define RISCV_DM_SBCS_SBACCESS_BITS   _u(0x000e0000)
#define RISCV_DM_SBCS_SBACCESS_MSB    _u(19)
#define RISCV_DM_SBCS_SBACCESS_LSB    _u(17)
#define RISCV_DM_SBCS_SBACCESS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBAUTOINCREMENT
// Description : When 1, sbaddress is incremented by the access size (in bytes)
//               selected in sbaccess after every system bus access.
#define RISCV_DM_SBCS_SBAUTOINCREMENT_RESET  _u(0x0)
#define RISCV_DM_SBCS_SBAUTOINCREMENT_BITS   _u(0x00010000)
#define RISCV_DM_SBCS_SBAUTOINCREMENT_MSB    _u(16)
#define RISCV_DM_SBCS_SBAUTOINCREMENT_LSB    _u(16)
#define RISCV_DM_SBCS_SBAUTOINCREMENT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBREADONDATA
// Description : When 1, every read from sbdata0 automatically triggers a system
//               bus read at the (possibly auto- incremented) address.
#define RISCV_DM_SBCS_SBREADONDATA_RESET  _u(0x0)
#define RISCV_DM_SBCS_SBREADONDATA_BITS   _u(0x00008000)
#define RISCV_DM_SBCS_SBREADONDATA_MSB    _u(15)
#define RISCV_DM_SBCS_SBREADONDATA_LSB    _u(15)
#define RISCV_DM_SBCS_SBREADONDATA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBERROR
// Description : When the Debug Module’s system bus master encounters an error,
//               this field gets set. The bits in this field remain set until
//               they are cleared by writing 1 to them. While this field is non-
//               zero, no more system bus accesses can be initiated by the Debug
//               Module.
//
//               An implementation may report “Other” (7) for any error
//               condition. (Hazard3 does not use this value for any errors.)
//
//               0: There was no bus error.
//
//               1: There was a timeout.
//
//               2: A bad address was accessed.
//
//               3: There was an alignment error.
//
//               4: An access of unsupported size was requested.
//
//               7: Other.
//
//               Hazard3 raises an alignment error for any non-naturally-aligned
//               bus transfer which would otherwise be a valid transfer.
#define RISCV_DM_SBCS_SBERROR_RESET  _u(0x0)
#define RISCV_DM_SBCS_SBERROR_BITS   _u(0x00007000)
#define RISCV_DM_SBCS_SBERROR_MSB    _u(14)
#define RISCV_DM_SBCS_SBERROR_LSB    _u(12)
#define RISCV_DM_SBCS_SBERROR_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBASIZE
// Description : Width of system bus addresses in bits. (0 indicates there is no
//               bus access support.)
#define RISCV_DM_SBCS_SBASIZE_RESET  _u(0x20)
#define RISCV_DM_SBCS_SBASIZE_BITS   _u(0x00000fe0)
#define RISCV_DM_SBCS_SBASIZE_MSB    _u(11)
#define RISCV_DM_SBCS_SBASIZE_LSB    _u(5)
#define RISCV_DM_SBCS_SBASIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBACCESS128
// Description : 1 when 128-bit system bus accesses are supported.
#define RISCV_DM_SBCS_SBACCESS128_RESET  _u(0x0)
#define RISCV_DM_SBCS_SBACCESS128_BITS   _u(0x00000010)
#define RISCV_DM_SBCS_SBACCESS128_MSB    _u(4)
#define RISCV_DM_SBCS_SBACCESS128_LSB    _u(4)
#define RISCV_DM_SBCS_SBACCESS128_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBACCESS64
// Description : 1 when 64-bit system bus accesses are supported.
#define RISCV_DM_SBCS_SBACCESS64_RESET  _u(0x0)
#define RISCV_DM_SBCS_SBACCESS64_BITS   _u(0x00000008)
