Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/riscv_dm.h
#define RISCV_DM_SBCS_SBACCESS64_MSB    _u(3)
#define RISCV_DM_SBCS_SBACCESS64_LSB    _u(3)
#define RISCV_DM_SBCS_SBACCESS64_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBACCESS32
// Description : 1 when 32-bit system bus accesses are supported.
#define RISCV_DM_SBCS_SBACCESS32_RESET  _u(0x1)
#define RISCV_DM_SBCS_SBACCESS32_BITS   _u(0x00000004)
#define RISCV_DM_SBCS_SBACCESS32_MSB    _u(2)
#define RISCV_DM_SBCS_SBACCESS32_LSB    _u(2)
#define RISCV_DM_SBCS_SBACCESS32_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBACCESS16
// Description : 1 when 16-bit system bus accesses are supported.
#define RISCV_DM_SBCS_SBACCESS16_RESET  _u(0x1)
#define RISCV_DM_SBCS_SBACCESS16_BITS   _u(0x00000002)
#define RISCV_DM_SBCS_SBACCESS16_MSB    _u(1)
#define RISCV_DM_SBCS_SBACCESS16_LSB    _u(1)
#define RISCV_DM_SBCS_SBACCESS16_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBCS_SBACCESS8
// Description : 1 when 8-bit system bus accesses are supported.
#define RISCV_DM_SBCS_SBACCESS8_RESET  _u(0x1)
#define RISCV_DM_SBCS_SBACCESS8_BITS   _u(0x00000001)
#define RISCV_DM_SBCS_SBACCESS8_MSB    _u(0)
#define RISCV_DM_SBCS_SBACCESS8_LSB    _u(0)
#define RISCV_DM_SBCS_SBACCESS8_ACCESS "RO"
// =============================================================================
// Register    : RISCV_DM_SBADDRESS0
// Description : System Bus Address 31:0
//
//               When the system bus master is busy, writes to this register
//               will set sbbusyerror and don’t do anything else.
//
//               If sberror is 0, sbbusyerror is 0, and sbreadonaddr is set then
//               writes to this register start the following:
//
//               1. Set sbbusy.
//
//               2. Perform a bus read from the new value of sbaddress.
//
//               3. If the read succeeded and sbautoincrement is set, increment
//               sbaddress.
//
//               4. Clear sbbusy.
#define RISCV_DM_SBADDRESS0_OFFSET _u(0x000000e4)
#define RISCV_DM_SBADDRESS0_BITS   _u(0xffffffff)
#define RISCV_DM_SBADDRESS0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBADDRESS0_ADDRESS
// Description : Accesses bits 31:0 of the physical address in sbaddress.
#define RISCV_DM_SBADDRESS0_ADDRESS_RESET  _u(0x00000000)
#define RISCV_DM_SBADDRESS0_ADDRESS_BITS   _u(0xffffffff)
#define RISCV_DM_SBADDRESS0_ADDRESS_MSB    _u(31)
#define RISCV_DM_SBADDRESS0_ADDRESS_LSB    _u(0)
#define RISCV_DM_SBADDRESS0_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : RISCV_DM_SBDATA0
// Description : System Bus Data 31:0
//
//               Any successful system bus read updates sbdata. If the width of
//               the read access is less than the width of sbdata, the contents
//               of the remaining high bits may take on any value.
//
//               If sberror or sbbusyerror both aren’t 0 then accesses do
//               nothing.
//
//               If the bus master is busy then accesses set sbbusyerror, and
//               don’t do anything else. Writes to this register start the
//               following:
//
//               1. Set sbbusy.
//
//               2. Perform a bus write of the new value of sbdata to sbaddress.
//
//               3. If the write succeeded and sbautoincrement is set, increment
//               sbaddress.
//
//               4. Clear sbbusy.
//
//               Reads from this register start the following:
//
//               1. “Return” the data.
//
//               2. Set sbbusy.
//
//               3. If sbreadondata is set, perform a system bus read from the
//               address contained in sbaddress, placing the result in sbdata.
//
//               4. If the read was successful, and sbautoincrement is set,
//               increment sbaddress.
//
//               5. Clear sbbusy.
#define RISCV_DM_SBDATA0_OFFSET _u(0x000000f0)
#define RISCV_DM_SBDATA0_BITS   _u(0xffffffff)
#define RISCV_DM_SBDATA0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RISCV_DM_SBDATA0_DATA
#define RISCV_DM_SBDATA0_DATA_RESET  _u(0x00000000)
#define RISCV_DM_SBDATA0_DATA_BITS   _u(0xffffffff)
#define RISCV_DM_SBDATA0_DATA_MSB    _u(31)
#define RISCV_DM_SBDATA0_DATA_LSB    _u(0)
#define RISCV_DM_SBDATA0_DATA_ACCESS "RW"
// =============================================================================
// Register    : RISCV_DM_HALTSUM0
// Description : Each bit in this read-only register indicates whether one
//               specific hart is halted or not. Unavailable/nonexistent harts
//               are not considered to be halted.
//
//               On RP2350, only the two LSBs of this register are implemented,
//               one for each core/hart.
//
//               This entire register is read-only.
#define RISCV_DM_HALTSUM0_OFFSET _u(0x00000100)
#define RISCV_DM_HALTSUM0_BITS   _u(0xffffffff)
#define RISCV_DM_HALTSUM0_RESET  _u(0x00000000)
#define RISCV_DM_HALTSUM0_MSB    _u(31)
#define RISCV_DM_HALTSUM0_LSB    _u(0)
#define RISCV_DM_HALTSUM0_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_RISCV_DM_H

